Repository: medlav/residency_portfolio
Catalog: lib/l10n/app_*.arb
Languages: it

# appTitle
source: Residency Portfolio
it: Portfolio SSM

# welcomeMessage
source: Welcome {username}
it: Benvenuto {username}

# progressSubtitle
source: Track your progress and activities.
it: Tieni traccia dei tuoi progressi e attività.

source: Loading data...
it: Caricamento dati...

# statProcedures
source: Procedures
it: Procedure

# statExams
source: Exams
it: Esami

# statCredits
source: Credits
it: Crediti

# drawerTooltip
source: Open Drawer
it: Apri Menù

# drawerProfile
source: Profile
it: Profilo

# drawerActivities
source: Activities
it: Attività

# drawerSettings
source: Settings
it: Impostazioni

# drawerInfo
source: Info
it: Informazioni

# drawerVersion
source: Version {version}
it: Versione {version}

# infoScreenTitle
source: About This App
it: Informazioni sull'App

# infoSectionTitlePurpose
source: Purpose
it: Scopo

# infoSectionDescription
source: This free, open-source application is designed exclusively to assist medical residents in digitally logging, tracking, and structuring their activities, procedures, and learning goals for their professional residency portfolio.
it: Questa applicazione gratuita e open-source è progettata esclusivamente per assistere i medici specializzandi nella registrazione, tracciamento e strutturazione digitale delle loro attività, procedure e obiettivi di apprendimento per il loro portfolio di specializzazione professionale.

# infoSectionTitleLicense
source: License & Disclaimer
it: Licenza e Disclaimer

# disclaimerTitle
source: BSD-3 Clause Simplified Disclaimer
it: Disclaimer Semplificato BSD-3

# disclaimerBody1
source: This software is provided 'as is,' is free to use, modify, and distribute. We are NOT liable for any damages or losses related to its use. The authors and contributors provide NO warranty, express or implied, regarding its functionality, accuracy, or fitness for a particular purpose.
it: Questo software è fornito 'così com'è' ed è gratuito da usare, modificare e distribuire. NON siamo responsabili per eventuali danni o perdite derivanti dall'uso di questo software. Gli autori e i contributori NON forniscono alcuna garanzia, esplicita o implicita, riguardo alla sua funzionalità, accuratezza o idoneità per uno scopo particolare.

# disclaimerBody2
source: This software utilizes a local database, and its reliability cannot be guaranteed. The user assumes sole responsibility for all data entered and the maintenance of profile settings. In the event of data loss, corruption, or profile setting malfunctions, the authors and contributors shall not be held liable.
it: Questo software utilizza un database locale e la sua affidabilità non può essere garantita. L'utente si assume la responsabilità esclusiva per tutti i dati inseriti e per la manutenzione delle impostazioni del profilo. In caso di perdita, corruzione dei dati o malfunzionamenti delle impostazioni del profilo, gli autori e i contributori non saranno ritenuti responsabili.

# infoTileSourceCode
source: Source Code (GitHub)
it: Codice Open Source (GitHub)

# infoTilePrivacyPolicy
source: Privacy Policy
it: Politica sulla Privacy

# buttonHomepageTooltip
source: Go to Homepage
it: Torna alla Homepage

# buttonViewActivities
source: View all the Activities
it: Visualizza tutte le Attività

# buttonLogActivity
source: Log new Activity
it: Registra nuova Attività

# settingsButtonTooltip
source: Settings
it: Impostazioni

# settingsTitle
source: Settings
it: Impostazioni

# settingsProfileSubtitle
source: View & edit your personal details
it: Visualizza e modifica i tuoi dettagli personali

# settingsProfilePlaceholderName
source: Unregistered User
it: Utente Sconosciuto

# settingsSectionPortfolio
source: Portfolio Management
it: Gestione Portfolio

# settingsPortfolioSubtitle
source: Manage Portfolio
it: Gestisci il Portfolio

# settingsCategoriesTitle
source: Categories
it: Categorie Attività

# settingsSpecialtiesTitle
source: Specialties
it: Specializzazioni

# settingsSpecialtiesSubtitle
source: Check the portfolio required for every Specialty (e.g., Cardiology, Radiology)
it: Controlla il portfolio richiesto per ogni specializzazione (e.g., Cardiologia, Radiologia)

# settingsCategoriesSubtitle
source: Manage activity categories (e.g., Exam, Procedure)
it: Gestisci le categorie di attività (es. Esame, Procedura)

# settingsBackupDataTitle
source: Backup Data
it: Backup Dati

# settingsBackupDataSubtitle
source: Export portfolio data to a file (JSON, CSV)
it: Esporta i dati del portfolio in un file (JSON, CSV)

# settingsSectionAppearance
source: Appearance
it: Aspetto

# settingsDarkModeTitle
source: Dark Mode
it: Modalità Scura

# settingsDarkModeSubtitle
source: Toggle application theme
it: Attiva/disattiva il tema dell'applicazione

# settingsLanguageTitle
source: Change Language
it: Cambia Lingua

# languageChangeConfirmTitle
source: Confirm Language Change to {languageName}?
it: Confermi il cambio in {languageName}?

# languageChangeConfirmMessage
source: Changing the language requires the app to restart. Continue?
it: Il cambio di lingua richiede il riavvio dell'applicazione. Continuare?

# languageChangeConfirmButton
source: Confirm
it: Conferma

# buttonCancel
source: Cancel
it: Annulla

source: Restarting app...
it: Riavvio dell'app...

# settingsSectionAbout
source: About
it: Informazioni

# settingsAppVersionTitle
source: App Version
it: Versione App

# settingsExportFormatDialogTitle
source: Select Export Format
it: Seleziona Formato di Esportazione

# settingsExportJsonTitle
source: Export as JSON
it: Esporta come JSON

# settingsExportJsonSubtitle
source: Perfect for programmatic use.
it: Perfetto per l'uso programmatico.

# settingsExportCsvTitle
source: Export as CSV
it: Esporta come CSV

# settingsExportCsvSubtitle
source: Easy to view in Excel/Sheets.
it: Facile da visualizzare in Excel/Fogli.

# settingsExportPdfTitle
source: Export as PDF
it: Esporta come PDF

# settingsExportPdfSubtitle
source: For printing and formal submission.
it: Per la stampa e la presentazione formale.

# settingsExportSnackBarMessage
source: Starting export of data to {format}...
it: Avvio dell'esportazione dei dati in {format}...

# searchPlaceholder
source: Search activities, modules, or competences
it: Cerca attività, moduli o competenze

# portfolioTabCurrentCurriculum
source: Current Curriculum
it: Curriculum Corrente

# portfolioTabResidencyPortfolio
source: Residency Portfolio
it: Portfolio di Specializzazione

# portfolioTabOngoingActivities
source: Ongoing Activities
it: Attività in Corso

# portfolioTabToDoProgrammed
source: Programmed Activities
it: Attività Programmate

# portfolioContentOngoing
source: Ongoing Activities and Assessments
it: Attività e Valutazioni in Corso

# portfolioContentTodo
source: To Do / Programmed
it: Da Fare / Programmate

# portfolioTitle
source: Residency Curriculum
it: Portfolio di Specializzazione

# portfolioSectionSelectSpecialty
source: Select Residency Specialty:
it: Seleziona la Specializzazione:

# portfolioLabelSpecialty
source: Residency Track
it: Percorso di Specializzazione (Specialità)

# portfolioNoSpecialtyData
source: No Specialty Data
it: Nessun Dato di Specializzazione

# portfolioNoCategoryError
source: No Category Data
it: Nessuna Categoria di Attività

# portfolioSectionCurriculum
source: Minimum Curriculum for {specialty}:
it: Curriculum Minimo per {specialty}:

# portfolioNoCurriculumActivities
source: No minimum curriculum activities defined for {specialty}.
it: Nessuna attività di curriculum minimo definita per {specialty}.

# portfolioTableActivityDescription
source: Activity Description
it: Descrizione Attività

# portfolioTableMinUnits
source: Min Units
it: Unità Minime

# portfolioTableRequiredDept
source: Required Departments
it: Reparti e Dipartimenti

# portfolioTableLog
source: Log
it: Registra

# portfolioLogActivityTooltip
source: Log Activity
it: Registra Attività

# portfolioLogActivitySnackbar
source: Logging activity: {activity}
it: Registrazione attività: {activity}

# portfolioFullDescription
source: Full Description:
it: Descrizione Completa:

# portfolioAllRequiredDepartments
source: All Required Departments:
it: Tutti i Reparti Richiesti:

# profileTitle
source: Edit Profile
it: Modifica Profilo

# profileLabelFullName
source: Full Name
it: Nome Completo

# profileLabelEmail
source: Email Address
it: Indirizzo Email

# profileLabelSpecialty
source: Specialty (e.g., Surgery, Peds)
it: Specializzazione (es. Chirurgia, Pediatria)

# profileLabelResidencyYear
source: Residency Year (e.g., PGY-3, R-2)
it: Anno di Specializzazione (es. 1°, 2°)

# profileLabelInstitution
source: Institution/Program Name
it: Nome Istituzione/Programma

# profileValidationNameRequired
source: Name is required
it: Il nome è richiesto

# profileValidationEmailInvalid
source: Enter a valid email
it: Inserisci un'email valida

# profileValidationSpecialtyRequired
source: Specialty is required
it: La specializzazione è richiesta

# profileValidationYearRequired
source: Year is required
it: L'anno è richiesto

# profileValidationInstitutionRequired
source: Institution is required
it: L'Istituto è richiesto

# profileButtonSaveChanges
source: Save Changes
it: Salva Modifiche

# profileSaveSuccess
source: Profile updated successfully
it: Profilo Aggiornato con Successo!

# profileSaveError
source: Error saving profile:
it: Errore durante il salvataggio:

# profileImagePickerTBD
source: Image picker functionality TBD.
it: Funzionalità di selezione immagine non implementata.

# activityListTitle
source: Activities Tracker
it: Gestione Attività

# activityListTotalCredits
source: Total Credits/Hours Logged:
it: Crediti/Ore Totali Registrate:

# activityListEmptyState
source: No activities logged yet. Tap the + to begin!
it: Nessuna attività registrata. Tocca il + per iniziare!

# activityListNewActivityButton
source: New Activity
it: Nuova Attività

# activityListDeleteSnackbar
source: {activityName} deleted.
it: {activityName} eliminata.

# activityListCreditsHoursLabel
source: Credits/Hrs
it: Crediti/Ore

# activityListCategory
source: Category: {category}
it: Categoria: {category}

# activityListDate
source: Date: {date}
it: Data: {date}

# activityListNotes
source: Notes: {notes}
it: Note: {notes}

# activityListNotesPlaceholder
source: N/A
it: N/D

# activityFormTitleEdit
source: Edit Activity
it: Modifica Attività

# activityFormTitleAdd
source: Add New Activity
it: Aggiungi Nuova Attività

# activityFormLabelName
source: Activity Name (e.g. Intravenous injection)
it: Nome dell'Attività (e.g. Iniezione endovenosa)

# activityFormValidationNameRequired
source: Please enter the activity name.
it: Inserisci il nome dell'attività.

# activityFormLabelCategory
source: Category/Activity Area
it: Categoria/Area di Attività

# activityFormLabelCreditsHours
source: Credits / Hours Logged
it: Crediti / Ore Registrate

# activityFormValidationCreditsInvalid
source: Please enter a valid number.
it: Inserisci un numero valido.

# activityFormValidationCreditsPositive
source: The value must be positive.
it: Il valore deve essere positivo.

# activityFormLabelDate
source: Activity Date
it: Data dell'Attività

# activityFormLabelNotes
source: Notes/Reflections (e.g., supervising physician, context)
it: Note/Riflessioni (e.g., medico supervisore, contesto)

# activityFormButtonSave
source: Save Changes
it: Salva Modifiche

# activityFormButtonAdd
source: Add Activity
it: Aggiungi Attività

# activityFormSuccessAdd
source: Activity added successfully!
it: Attività aggiunta con successo!

# activityFormSuccessUpdate
source: Activity updated successfully!
it: Attività aggiornata con successo!

# activityFormErrorSave
source: Save error:
it: Errore di salvataggio:

# activityFormCategory1
source: Activity I: Clinical Area (Intensive Care)
it: Attività I: Area Clinica (Terapia Intensiva)

# activityFormCategory2
source: Activity II: Diagnostic Area
it: Attività II: Area Diagnostica

# activityFormCategory3
source: Activity III: Research & Management Area
it: Attività III: Area Ricerca & Gestione

# activityFormCategory4
source: Activity IV: Teaching & Communication Area
it: Attività IV: Area Didattica & Comunicazione

# activityFormCategory5
source: Activity V: Occupational Medicine
it: Attività V: Medicina del Lavoro

# activityFormCategoryOther
source: Other
it: Altro

# specialtySearchHeader
source: Search Activities for {specialty}:
it: Cerca Attività per {specialty}:

# specialtySelectActivityHint
source: Search portfolio activity
it: Cerca attività del portfolio

# specialtySearchHint
source: e.g., "Physical examination" or "Appendectomy"
it: e.g., "Esame fisico" o "Appendicectomia"

# specialtyDetailHeader
source: Selected Activity Metadata:
it: Metadati dell'Attività Selezionata:

# specialtyDetailPesoLabel
source: Peso (Min Units)
it: Peso (Unità Minime)

# specialtyDetailDepartmentLabel
source: Required Department/Sector
it: Reparto/Settore Richiesto

# specialtyDetailButtonSave
source: Save Activity
it: Salva Attività

# specialtyDetailButtonSaveSuccess
source: Activity '{activity}' managed for {specialty}!
it: Attività '{activity}' gestita per {specialty}!

# errorLoadingCategories
source: Failed to load categories: {error}
it: Errore nel caricamento delle categorie: {error}

# noCategoriesAvailable
source: No categories found. Use the '+' button to add one.
it: Nessuna categoria trovata. Usa il pulsante '+' per aggiungerne una.

# categoryDescriptionLabel
source: Description:
it: Descrizione:

source: No description provided.
it: Nessuna descrizione fornita.

source: Edit
it: Modifica

source: Delete
it: Elimina

# activityFormLabelDateEnd
source: End Date (Optional)
it: Data di fine (Opzionale)

# activityFormLabelDateEndEmpty
source: Select end date
it: Seleziona data di fine

# activityFormButtonClearDate
source: Clear Date
it: Cancella Data

# activityListDateRange
source: Date: {dateRange}
it: Data: {dateRange}

# deleteEntrySuccess
source: Entry deleted successfully.
it: Voce eliminata con successo.

# deleteEntryError
source: Failed to delete entry.
it: Errore durante l'eliminazione della voce.

# buttonDeleteActivity
source: Delete Activity
it: Elimina Attività

# dialogDeleteConfirmationTitle
source: Confirm Deletion
it: Conferma Eliminazione

# dialogDeleteConfirmationContent
source: Are you sure you want to permanently delete this entry?
it: Sei sicuro di voler eliminare definitivamente questa voce?

# dialogSaveConfirmationTitle
source: Confirm New Entry
it: Conferma Nuova Voce

# dialogSaveConfirmationContent
source: Are you sure you want to save this new activity?
it: Sei sicuro di voler salvare questa nuova attività?

# dialogUpdateConfirmationTitle
source: Confirm Changes
it: Conferma Modifiche

# dialogUpdateConfirmationContent
source: Are you sure you want to apply these changes to the existing entry?
it: Sei sicuro di voler applicare queste modifiche alla voce esistente?

# buttonConfirmSave
source: Save
it: Salva

# buttonConfirmUpdate
source: Update
it: Aggiorna

# settingsExportDbTitle
source: Raw Database (.db)
it: Database Grezzo (.db)

# settingsExportDbSubtitle
source: Export the raw SQLite database file for technical backup or migration.
it: Esporta il file di database SQLite grezzo per backup tecnico o migrazione.

# activityFormLabelInstitution
source: Institution Name
it: Nome Istituzione

# activityFormValidationInstitutionRequired
source: Institution name is required.
it: Il nome dell'istituzione è obbligatorio.

# activityFormLabelDepartments
source: Department(s)
it: Dipartimento/i

# categoryDescriptionTitle
source: Category Description
it: Descrizione Categoria

# categoryDescriptionEmpty
source: No description available for this category.
it: Nessuna descrizione disponibile per questa categoria.

# buttonClose
source: Close
it: Chiudi

# activityFormCategoryInfoTooltip
source: View category description
it: Visualizza descrizione categoria

# portfolioContentCurriculumDashboard
source: Dashboard view of completed activities and progress will go here.
it: Qui verrà visualizzata la dashboard con le attività completate e i progressi.

# portfolioContentUpcomingEmpty
source: No programmed activities found. Plan your future tasks!
it: Nessuna attività programmata trovata. Pianifica i tuoi impegni futuri!

# portfolioContentOngoingEmpty
source: No activities are currently marked as ongoing.
it: Nessuna attività è attualmente contrassegnata come in corso.

source: No Results Found
it: Nessun risultato

source: No Data
it: Nessun Dato

# duplicateEntryTooltip
source: Duplicate Entry
it: Duplica l'Attività

# categoryFormTitleAdd
source: Add Category
it: Aggiungi Categoria

# categoryFormTitleEdit
source: Edit Category
it: Modifica Categoria

# categoryFormLabelName
source: Category Name
it: Nome Categoria

# categoryFormLabelAmountType
source: Amount Type
it: Tipo di Quantità

# categoryFormLabelMinAmount
source: Min Required Amount
it: Quantità Minima Richiesta

# categoryFormLabelRequiredDepts
source: Required Departments (comma separated)
it: Reparti Richiesti (separati da virgola)

# categoryFormLabelDescription
source: Description
it: Descrizione

# categoryFormValidationNameRequired
source: Enter a name
it: Inserisci un nome

# categoryFormButtonSave
source: Save Category
it: Salva Categoria

# categoryFormButtonUpdate
source: Update Category
it: Aggiorna Categoria

# categoryFormSuccessAdd
source: Category added
it: Categoria aggiunta

# categoryFormSuccessUpdate
source: Category updated
it: Categoria aggiornata

# categoryLabelUnit
source: Unit
it: Unità

# categoryDeleteConfirmation
source: Are you sure you want to delete '{name}'? Press Delete if you're sure or press Cancel to go back.
it: Sei sicuro di voler eliminare '{name}'? Premi Elimina per confermare o Annulla per tornare indietro.

# amountTypeNumber
source: number
it: numero

# amountTypeHours
source: hours
it: ore

# amountTypeCredits
source: credits
it: crediti

# categoryResetTitle
source: Reset Categories?
it: Ripristinare le categorie?

# categoryResetMessage
source: This will delete all custom categories and restore the defaults. This action cannot be undone.
it: Questo cancellerà tutte le categorie personalizzate e ripristinerà quelle predefinite. L'azione è irreversibile.

# categoryResetButton
source: Reset Everything
it: Ripristina tutto

# categoryResetTooltip
source: Reset to Defaults
it: Ripristina predefiniti

# menuTooltip
source: Show menu
it: Mostra menu

# infoTitle
source: Information
it: Informazioni

# activityFormSuccessDuplicate
source: Entry duplicated. You are now editing the copy.
it: Voce duplicata. Stai modificando la copia.

# privacyPolicyTitle
source: Privacy Policy
it: Informativa sulla Privacy

# privacyHeader
source: Data Privacy & Security
it: Privacy e Sicurezza dei Dati

# privacyLastUpdated
source: Last updated: February 2026
it: Ultimo aggiornamento: Febbraio 2026

# privacySection1Title
source: 1. Data Storage
it: 1. Archiviazione dei Dati

# privacySection1Content
source: All data entered into the Residency Portfolio, including your activities, credits, and institution names, is stored locally on your device. We do not use external cloud servers to host your portfolio entries.
it: Tutti i dati inseriti nell'applicazione Residency Portfolio, inclusi attività, crediti e nomi delle istituzioni sono memorizzati localmente sul tuo dispositivo. Non utilizziamo server cloud esterni per ospitare dati del tuo portfolio.

# privacySection2Title
source: 2. Personal Information
it: 2. Informazioni Personali

# privacySection2Content
source: Your name and email address are used solely for the purpose of personalizing your experience and generating your Curriculum Vitae. This information remains within the application.
it: Il tuo nome e l'indirizzo email sono utilizzati esclusivamente per personalizzare la tua esperienza e generare il tuo Curriculum Vitae. Queste informazioni rimangono all'interno dell'applicazione.

# privacySection3Title
source: 3. PDF Generation
it: 3. Generazione PDF

# privacySection3Content
source: When you export your curriculum to PDF, the document is generated locally. No data is transmitted to our servers during this process.
it: Quando esporti il tuo curriculum in formato PDF, il documento viene generato localmente. Nessun dato viene trasmesso ai nostri server durante questo processo.

# privacySection4Title
source: 4. Third-Party Access
it: 4. Accesso di Terze Parti

# privacySection4Content
source: We do not sell, trade, or otherwise transfer your residency data to outside parties. Your data is your professional property.
it: Non vendiamo, scambiamo o trasferiamo in alcun modo i dati della tua specializzazione a terze parti. I tuoi dati sono di tua proprietà personale.

# privacySection5Title
source: 5. Security
it: 5. Sicurezza

# privacySection5Content
source: Since data is stored locally, the security of your information depends on the security of your mobile device. We recommend using biometric or passcode locks on your device.
it: Poiché i dati sono archiviati localmente, la sicurezza delle tue informazioni dipende dalla sicurezza del tuo dispositivo mobile. Ti consigliamo di utilizzare blocchi biometrici o codici di accesso sul tuo dispositivo.

source: Export PDF
it: Esporta PDF

# curriculumHeaderTitle
source: Professional Curriculum
it: Curriculum Professionale

# curriculumHeaderSubtitle
source: Consolidated Experience Summary
it: Riepilogo Esperienze Certificate

# curriculumSummaryStats
source: {total} Total Credits Across {count} Activities
it: {total} Crediti Totali su {count} Attività

# curriculumAggregatedSessions
source: {count, plural, =1{Aggregated from 1 session} other{Aggregated from {count} sessions}}
it: {count, plural, =1{Aggregato da 1 sessione} other{Aggregato da {count} sessioni}}

# deleteImageTitle
source: Delete Profile Picture
it: Rimuovi Immagine Profilo

# deleteImageConfirmation
source: Are you sure you want to remove your profile picture?
it: Sicuro di voler rimuovere l'immagine?

source: Cancel
it: Indietro

# pdfFooterGeneratedOn
source: Generated via Residency Portfolio App on {date}
it: Generato via Residency Portfolio App in data {date}

# specialtyChangeLockedTitle
source: Specialty Change Locked
it: Specializzazione Bloccata

# specialtyChangeLockedContent
source: You have existing activities in your portfolio. To change your specialty, you must first delete all current activities to ensure data consistency.
it: Sono presenti attività nel tuo portfolio. Per cambiare specializzazione, devi prima eliminare tutte le attività correnti per garantire la coerenza dei dati.

# activityFormLabelMinRequirement
source: Minimum Required Credits/Hours
it: Requisito Minimo Crediti/Ore

# activityFormValidationMinRequired
source: The minimum requirement for this category is
it: Il requisito minimo per questa categoria è

# importSuccess
source: Database restored successfully!
it: Database ripristinato con successo!

source: Import cancelled
it: Importazione annullata

# importError
source: Import failed: {error}
it: Importazione fallita: {error}

# webNotSupported
source: This feature is not available on the web version.
it: Questa funzione non è disponibile nella versione web.

# importInvalid
source: The selected file is not a valid Portfolio backup.
it: Il file selezionato non è un backup valido di Portfolio.

# importConfirmTitle
source: Overwrite Data?
it: Sovrascrivere i dati?

# importConfirmMessage
source: This will delete all current entries and replace them with the backup. Continue?
it: Tutte le voci attuali verranno eliminate e sostituite con il backup. Continuare?
